Revit 2024 API
NumericRevisionSettings Constructor
Overload List
Name | Description
NumericRevisionSettings()
 Constructs a NumericRevisionSettings with a simple, default numbering sequence.
NumericRevisionSettings(NumericRevisionSettings)
 Constructs a new copy of the input NumericRevisionSettings object.
NumericRevisionSettings(Int32, String, String)
 Constructs a NumericRevisionSettings object.
See Also
NumericRevisionSettings Class
NumericRevisionSettings Members
Autodesk.Revit.DB Namespace